# 해당 자소 및 음소는 공식적인 문법이 아닐 수 있습니다. (보기에 더 좋게 설계됨)
# These consonants and phonemes may not be official grammar. (Designed to look better)


First_Consonant_DIC = {
    "ㄱ": "g",
    "ㄴ": "n",
    "ㄷ": "d",
    "ㄹ": "r",  # (초성에는 r, 받침과 이어지는 ㄹ은 l)
    "ㅁ": "m",
    "ㅂ": "b",
    "ㅅ": "s",
    "ㅇ": "",  # (초성에서 소리 없음)
    "ㅈ": "j",
    "ㅊ": "ch",
    "ㅋ": "k",
    "ㅌ": "t",
    "ㅍ": "p",
    "ㅎ": "h",
    "ㄲ": "gg",
    "ㄸ": "dd",
    "ㅃ": "bb",
    "ㅆ": "ss",
    "ㅉ": "jj",
}

Middle_Vowel_DIC = {
    "ㅏ": "a",
    "ㅑ": "ya",
    "ㅓ": "eo",
    "ㅕ": "yeo",
    "ㅗ": "o",
    "ㅛ": "yo",
    "ㅜ": "u",
    "ㅠ": "yu",
    "ㅡ": "eu",
    "ㅣ": "i",
    # "ㅐ": "ae",
    # "ㅒ": "yae",
    "ㅔ": "e",
    "ㅖ": "ye",
    "ㅘ": "wa",
    "ㅝ": "weo",
    "ㅚ": "oe",
    "ㅟ": "wi",
    # "ㅙ": "wae",
    # "ㅞ": "we",
    "ㅢ": "i",
}

# Middle_Vowel_DIC = {
#     "ㅏ": "a",
#     "ㅑ": "ya",
#     "ㅓ": "eo",
#     "ㅕ": "yeo",
#     "ㅗ": "o",
#     "ㅛ": "yo",
#     "ㅜ": "u",
#     "ㅠ": "yu",
#     "ㅡ": "eu",
#     "ㅣ": "i",
#     # "ㅐ": "ae",
#     # "ㅒ": "yae",
#     "ㅔ": "e",
#     "ㅖ": "ye",
#     "ㅘ": "wa",
#     "ㅝ": "weo",
#     "ㅚ": "oe",
#     "ㅟ": "wi",
#     # "ㅙ": "wae",
#     # "ㅞ": "we",
#     # "ㅢ": "eui",
# }

Last_Consonant_DIC = {  # 음절 끝소리 규칙
    "ㄱ": "G",
    "ㄴ": "N",
    "ㄷ": "D",
    "ㄹ": "L",  # (받침 ㄹ은 l)
    "ㅁ": "M",
    "ㅂ": "B",
    "ㅇ": "NG",  # (받침만)
}

# Last_Consonant_DIC = {
#     "ㄱ": "g",
#     "ㄴ": "n",
#     "ㄷ": "d",
#     "ㄹ": "l",  # (받침 ㄹ은 l)
#     "ㅁ": "m",
#     "ㅂ": "b",
#     "ㅅ": "s",
#     "ㅇ": "ng",  # (받침만)
#     "ㅈ": "j",
#     "ㅊ": "ch",
#     "ㅋ": "k",
#     "ㅌ": "t",
#     "ㅍ": "p",
#     "ㅎ": "h",
#     "ㄲ": "gg",
#     "ㄸ": "dd",
#     "ㅃ": "bb",
#     "ㅆ": "ss",
#     "ㅉ": "jj",
# }
